In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
l = [4,8,15,16,23,42]

In [26]:
ser = pd.Series(l)

In [27]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [29]:
ser.dtypes

dtype('int64')

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [30]:
var = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [31]:
variable = pd.Series(var)

In [32]:
variable

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data

Name       Age    Gender
Alice      25     Female
Bob        30     Male
Claire     27     Female



Then, print the DataFrame.

In [39]:
data = pd.DataFrame({'Name' : ['Alice' , 'Bob' , 'Clarie'], 'Age' : [ 25, 30, 27], 'Gender' : ["Female", "Male", "Female"]})

In [40]:
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It can be thought of as a spreadsheet or a SQL table. Each column of a DataFrame is a pandas Series

A pandas Series is a one-dimensional labeled array capable of holding data of any type.

The main difference between a DataFrame and a Series is that a Series represents a single column of data, while a DataFrame is a table-like structure with rows and columns. A DataFrame can be thought of as a collection of Series objects, where each column is a Series.

In [ ]:
Examples are:

In [41]:
series = pd.Series([1,2,3,4,5], name= "my column")

In [42]:
series

0    1
1    2
2    3
3    4
4    5
Name: my column, dtype: int64

In [43]:
dataframe = pd.DataFrame({"name":["raj","vikas","vikram"],"age":[34, 56, 19]})

In [44]:
dataframe

     name  age
0     raj   34
1   vikas   56
2  vikram   19

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

There are many functions available in Pandas that can be used to manipulate data in a DataFrame. Here are some common ones:

head() and tail(): These functions are used to display the first or last n rows of the DataFrame, respectively. They are useful for quickly inspecting the data.

describe(): This function generates descriptive statistics of the DataFrame, such as count, mean, standard deviation, minimum and maximum values, and quartiles. It is useful for getting a quick overview of the data.

loc[] and iloc[]: These are indexing functions used to select rows and columns of the DataFrame based on their labels or integer positions, respectively. They can be used to filter or slice the data.

groupby(): This function is used to group the data by one or more columns and apply a function to each group. It is useful for aggregating or summarizing the data.

fillna(): This function is used to fill missing values in the DataFrame with a specified value or a method such as forward or backward filling. It is useful for handling missing data.

drop(): This function is used to drop rows or columns from the DataFrame based on their labels or integer positions, respectively. It is useful for removing unnecessary data.

apply(): This function is used to apply a function to each element or row of the DataFrame. It is useful for transforming or processing the data.

In [ ]:
import pandas as pd

# create sample DataFrame

df = pd.DataFrame(data)

# group by region and calculate total sales
sales_by_region = df.groupby('region')['sales'].sum()

# display the result
print(sales_by_region)

In [45]:
data = {'product': ['A', 'B', 'C', 'D', 'E', 'F'],
        'region': ['East', 'West', 'East', 'West', 'North', 'South'],
        'sales': [100, 200, 150, 250, 180, 300]}

In [46]:
data1 = pd.DataFrame(data)

In [48]:
data1

  product region  sales
0       A   East    100
1       B   West    200
2       C   East    150
3       D   West    250
4       E  North    180
5       F  South    300

In [47]:
data1.head()

  product region  sales
0       A   East    100
1       B   West    200
2       C   East    150
3       D   West    250
4       E  North    180

In [49]:
data1.tail()

  product region  sales
1       B   West    200
2       C   East    150
3       D   West    250
4       E  North    180
5       F  South    300

In [50]:
data1.describe()

            sales
count    6.000000
mean   196.666667
std     71.180522
min    100.000000
25%    157.500000
50%    190.000000
75%    237.500000
max    300.000000

In [58]:
data1.loc[1]

product       B
region     West
sales       200
Name: 1, dtype: object

In [52]:
data1.iloc[0]

product       A
region     East
sales       100
Name: 0, dtype: object

In [60]:
data1

  product region  sales
0       A   East    100
1       B   West    200
2       C   East    150
3       D   West    250
4       E  North    180
5       F  South    300

In [62]:
sales_by_region = data1.groupby('region')['sales'].sum()

In [63]:
sales_by_region

region
East     250
North    180
South    300
West     450
Name: sales, dtype: int64

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature.

Series can be modified by assigning new values to the index labels, and DataFrame can be modified by adding, removing, or updating rows and columns.

Panel, on the other hand, is a 3-dimensional data structure that is now deprecated in favor of multi-indexed DataFrames. It was mutable in nature and could be modified by adding, removing or updating items in the underlying data.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

A DataFrame can be created using multiple Series by passing a dictionary of Series to the DataFrame constructor. Each Series will become a column of the DataFrame, and the keys of the dictionary will become the column names.

In [65]:
name = pd.Series(["raj kumar" , "vikram" , "ganesh" , "vikas"])
age = pd.Series([ 19, 18, 24, 34])
gender = pd.Series(["Male", "Male",  "Male",  "Male"])

In [68]:
details = pd.DataFrame({'Name' : name ,'Age':age , "Gender":gender})

In [69]:
details

        Name  Age Gender
0  raj kumar   19   Male
1     vikram   18   Male
2     ganesh   24   Male
3      vikas   34   Male